[
  {
    "_id": "5af6ac508a793684ffdfced0",
    "index": 0,
    "guid": "06d82fa2-cd63-458b-acc8-4457afdc9c70",
    "name": "cupidatat qui incididunt",
    "brand": "PARAGONIA",
    "descShort": "Labore culpa commodo velit magna pariatur amet.",
    "descFull":
      "Non sit laborum voluptate nisi sit. Laborum esse sit velit est quis anim qui sunt. Incididunt anim pariatur ex ullamco dolor laborum ex amet. Dolor sunt Lorem ex do fugiat non veniam cupidatat non amet amet sit et excepteur. Dolor anim nisi reprehenderit incididunt duis amet aliquip mollit exercitation reprehenderit dolor cillum velit. Id incididunt ipsum amet ex eu ut sint minim dolor ullamco non velit. Tempor eiusmod ea enim magna tempor pariatur aliquip qui commodo sit pariatur elit ad non.\n\nAliquip cupidatat nulla pariatur non culpa duis nisi dolor quis cupidatat. Dolore occaecat proident tempor ullamco. Aute deserunt nostrud reprehenderit anim eu enim ut. Eiusmod cillum in veniam nisi est adipisicing id exercitation reprehenderit exercitation tempor. Cupidatat sunt laboris magna pariatur minim id aliquip nulla exercitation ex sunt eu minim.\n\nAute excepteur fugiat anim id. Enim magna in et in veniam sit amet aliquip exercitation occaecat. Ipsum eu amet ullamco quis. Proident duis qui mollit ipsum ex ad ad mollit nulla proident. Culpa qui Lorem enim esse sit dolor aliquip sit.",
    "isFavourite": false,
    "rating": 4,
    "price": "$316.20",
    "oldPrice": "$579.43",
    "savings": "$69.77",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "l"
  },
  {
    "_id": "5af6ac50ce8df7ba8eb3aa77",
    "index": 1,
    "guid": "41a1f388-9d5b-40e5-b1fb-68bcb13ce850",
    "name": "ut fugiat duis",
    "brand": "EXTRAGEN",
    "descShort": "Amet dolor sunt enim reprehenderit officia velit elit mollit aliqua enim magna voluptate enim.",
    "descFull":
      "Non quis nisi irure eiusmod elit dolore incididunt reprehenderit adipisicing. Aliquip culpa eu enim id. Ut dolor duis excepteur nisi sunt. Duis consequat deserunt tempor consectetur ullamco fugiat qui anim amet officia velit aliqua eu. Qui ad mollit pariatur do aute eu esse.\n\nDuis nisi dolore exercitation non qui id. Duis ipsum do ipsum pariatur in enim Lorem exercitation laborum laborum laborum voluptate laboris. Dolor nisi labore commodo mollit pariatur labore cupidatat culpa. Fugiat aliqua duis tempor irure in reprehenderit consequat aliqua qui voluptate dolore proident mollit. Cupidatat proident mollit ipsum mollit labore do Lorem anim. Pariatur Lorem do aliqua ut laboris elit Lorem dolor Lorem magna. Quis eiusmod aliquip tempor minim nulla reprehenderit sint excepteur.\n\nVelit elit in et quis dolore minim cillum deserunt velit ut. Officia laboris sit officia non sunt labore ad exercitation sunt do. Consectetur commodo minim velit fugiat Lorem magna deserunt duis id excepteur adipisicing tempor labore. Exercitation laborum labore aliquip et ex elit veniam esse tempor. Sit aliquip cillum ex dolore ad elit. Sint ad in officia aute in laboris laboris labore voluptate ea dolor amet dolor proident.",
    "isFavourite": false,
    "rating": 3,
    "price": "$352.55",
    "oldPrice": "$604.29",
    "savings": "$87.76",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "s"
  },
  {
    "_id": "5af6ac506badf21245ada67a",
    "index": 2,
    "guid": "eb2cd259-67e3-458a-9af4-00c5ad7741f8",
    "name": "qui ea fugiat",
    "brand": "NORALEX",
    "descShort": "Culpa aliqua tempor culpa est in ut proident fugiat ad labore est.",
    "descFull":
      "Magna irure mollit aliquip consequat ad minim do aliquip. Aute adipisicing dolor ex fugiat ipsum voluptate nostrud nulla in culpa elit labore sit elit. Occaecat deserunt exercitation tempor sunt velit pariatur velit eiusmod ea duis. Dolor do commodo reprehenderit officia sint irure dolor nostrud sit proident ullamco nostrud commodo do. Velit est velit fugiat ipsum velit veniam cupidatat sit proident minim dolore pariatur id. Velit reprehenderit mollit cupidatat cillum qui ex cillum amet amet aliqua duis sit eiusmod.\n\nAliquip ea non adipisicing do anim elit laboris commodo minim ipsum commodo. Ipsum deserunt do consequat veniam veniam officia culpa exercitation Lorem. Ad duis adipisicing cupidatat mollit. Laborum magna id occaecat nostrud. Duis eu id fugiat non excepteur ea officia culpa ut labore quis culpa adipisicing proident. Dolor duis magna aliqua irure. Officia excepteur ex labore ex Lorem minim aute non incididunt cillum.\n\nSit minim irure proident proident in. Mollit in laboris commodo ullamco proident. Laboris officia deserunt deserunt aute ullamco irure veniam.",
    "isFavourite": false,
    "rating": 5,
    "price": "$202.33",
    "oldPrice": "$458.55",
    "savings": "$47.47",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "l"
  },
  {
    "_id": "5af6ac501fed68f155524c12",
    "index": 3,
    "guid": "6c29cdbc-964a-4010-80e8-4684a6bd5405",
    "name": "minim commodo nisi",
    "brand": "XLEEN",
    "descShort": "Id ullamco pariatur deserunt officia eiusmod sit consequat veniam mollit consectetur dolore est est.",
    "descFull":
      "Veniam non quis anim deserunt sint consectetur nisi nisi ut labore in dolore magna. Minim ullamco amet dolore nisi dolore aute consequat aute nisi. Elit ea id qui amet do in reprehenderit cillum excepteur labore aliquip. Dolor ea eiusmod ex ea Lorem sint aliquip voluptate quis consequat ut quis et cupidatat. Cupidatat cupidatat sunt pariatur do esse dolor minim veniam elit qui eiusmod veniam adipisicing aliqua.\n\nIpsum et laboris voluptate occaecat excepteur in non. Irure enim eiusmod adipisicing ea est minim incididunt fugiat laboris est. Et ea magna non aute cupidatat consequat duis consectetur pariatur id eu.\n\nEiusmod excepteur veniam minim veniam magna consequat velit dolore tempor aliquip dolor aliquip ipsum minim. Ipsum aliqua nulla ullamco in ut sunt. Proident nisi laborum mollit anim labore cupidatat elit qui est ex officia. Duis eiusmod mollit est qui excepteur eiusmod irure dolor enim veniam laborum fugiat. Anim elit eiusmod in deserunt veniam veniam cillum.",
    "isFavourite": false,
    "rating": 5,
    "price": "$260.02",
    "oldPrice": "$452.99",
    "savings": "$24.42",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "s"
  },
  {
    "_id": "5af6ac50a7db6924a912a377",
    "index": 4,
    "guid": "6c7ff7ad-7946-4d16-a3b9-00442614482e",
    "name": "id tempor proident",
    "brand": "RODEOLOGY",
    "descShort": "Ullamco irure eiusmod irure exercitation est laborum consequat veniam.",
    "descFull":
      "Esse sint laboris eiusmod nulla exercitation dolore est elit cillum quis velit sit id. Incididunt velit et nostrud veniam consectetur eu aliqua exercitation aliquip duis. Ipsum ea Lorem incididunt veniam deserunt qui officia et. Cillum consectetur ullamco non eu voluptate labore occaecat tempor Lorem sit aute quis mollit et.\n\nSint dolor duis ea proident fugiat do dolor est pariatur exercitation eu in nostrud. Eiusmod ullamco quis sit exercitation elit deserunt duis elit ea eu laboris consequat. Est irure dolore non irure minim et esse cillum adipisicing enim ea magna. Ex et amet nulla Lorem laboris adipisicing ut duis laborum nisi exercitation dolor nulla. Deserunt quis est excepteur sunt laborum mollit ipsum duis velit est amet.\n\nLabore veniam culpa ut anim et eu amet qui dolore consequat ea tempor aliquip. Cillum qui enim eiusmod ullamco officia. Mollit officia ex voluptate laboris laboris duis. Proident non consequat Lorem magna aliqua sit elit aliquip. Consequat veniam fugiat labore occaecat esse commodo aliqua amet in eu id ex ipsum. Culpa nisi esse ut esse ad et cillum minim incididunt.",
    "isFavourite": true,
    "rating": 2,
    "price": "$359.85",
    "oldPrice": "$896.66",
    "savings": "$92.29",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "l"
  },
  {
    "_id": "5af6ac50300f3484a3c5b160",
    "index": 5,
    "guid": "f47b902d-ba25-42ca-a956-2ddd3a8db094",
    "name": "laborum eu do",
    "brand": "BLURRYBUS",
    "descShort": "Nisi consectetur dolore ullamco fugiat culpa ut ullamco deserunt ut.",
    "descFull":
      "Nostrud ut ea pariatur consequat duis ex mollit anim est. Minim id ut cillum proident fugiat aliqua sit anim id veniam. Ea velit id elit est amet eu aute sit amet officia. Nulla qui Lorem pariatur in nisi nisi non aliquip sint proident id.\n\nNon tempor do sit dolore in cupidatat elit. Voluptate ipsum deserunt nisi eu quis nostrud do commodo enim nisi qui Lorem. Mollit duis reprehenderit ipsum nostrud sint excepteur exercitation adipisicing sunt do.\n\nLaboris proident commodo sit in veniam laborum magna consectetur occaecat culpa Lorem proident consequat labore. Ullamco duis et ut cupidatat enim. Nostrud laborum laborum occaecat labore cillum incididunt consequat minim pariatur ipsum officia dolore. Est in velit ex consequat. Pariatur laborum ea reprehenderit velit reprehenderit. Anim sit occaecat labore ex aliquip consectetur aliqua do.",
    "isFavourite": false,
    "rating": 4,
    "price": "$237.86",
    "oldPrice": "$404.97",
    "savings": "$62.23",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "l"
  },
  {
    "_id": "5af6ac50102fcbaeaed43f53",
    "index": 6,
    "guid": "feaf8a2c-cf6f-48ae-b6b0-b23f5645dd7a",
    "name": "sint mollit velit",
    "brand": "SENSATE",
    "descShort": "Esse voluptate esse aute Lorem consequat est elit cillum quis.",
    "descFull":
      "Occaecat nisi enim culpa commodo enim aliqua duis proident anim. Dolore adipisicing et quis fugiat aliqua commodo dolor laborum aliqua magna eiusmod incididunt. Enim pariatur laboris non proident nulla magna culpa consequat non Lorem. Id id id voluptate ullamco aliqua. Non nisi est Lorem incididunt consequat.\n\nConsequat tempor eiusmod deserunt id et ipsum eiusmod anim aute. Ad mollit proident laboris velit. Irure minim magna laboris nostrud ipsum. Sunt sit commodo mollit nisi enim voluptate qui adipisicing commodo proident occaecat aute ut.\n\nAliquip consectetur labore do ullamco velit consequat cupidatat eiusmod ad ipsum elit sunt. Laboris non do incididunt labore consequat excepteur tempor. Est veniam eiusmod pariatur nisi cupidatat. Reprehenderit sunt ad aute quis non ut. Adipisicing incididunt nisi sunt dolor sunt ullamco reprehenderit non in elit. Deserunt nulla tempor aute proident dolore ut elit tempor reprehenderit officia duis. Nostrud aliqua laboris elit do sit eu.",
    "isFavourite": false,
    "rating": 2,
    "price": "$295.97",
    "oldPrice": "$567.08",
    "savings": "$25.63",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "m"
  },
  {
    "_id": "5af6ac5018ce573614604bd6",
    "index": 7,
    "guid": "242366af-b7d7-4206-8d86-ff3aac73cdec",
    "name": "duis id sit",
    "brand": "EURON",
    "descShort": "Sunt dolore consequat ex amet amet qui ut ullamco aute.",
    "descFull":
      "Est excepteur exercitation labore sunt aliquip nulla. Voluptate officia consequat sit sit laboris cupidatat do non reprehenderit exercitation. Est culpa officia ad ullamco culpa labore veniam dolore mollit ad et sit.\n\nDo non nisi nulla adipisicing cupidatat deserunt proident nisi incididunt occaecat. Est excepteur deserunt nulla in. Fugiat id culpa incididunt proident pariatur. Proident ipsum quis ea minim commodo mollit proident magna sint eu duis adipisicing. Aliqua id irure ut consectetur do adipisicing consectetur cillum nisi aliquip exercitation veniam. Laboris labore esse in culpa adipisicing ad ex proident est occaecat sunt ea reprehenderit ullamco.\n\nAliquip ullamco excepteur laboris consectetur reprehenderit qui aliqua nostrud aliqua. Nulla aliqua in dolore id Lorem. Laboris do amet in culpa adipisicing nostrud. Proident excepteur elit qui mollit cupidatat nulla in reprehenderit reprehenderit. Ut fugiat id aliquip sit nulla aliquip culpa eiusmod commodo consequat non dolore. Sint et fugiat nisi pariatur cupidatat exercitation eiusmod qui esse ex do sunt ad. Consectetur voluptate nisi velit non et sunt Lorem eu Lorem nisi laboris ut in.",
    "isFavourite": true,
    "rating": 1,
    "price": "$364.67",
    "oldPrice": "$971.37",
    "savings": "$68.46",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "xl"
  },
  {
    "_id": "5af6ac50a6472ddc1873b749",
    "index": 8,
    "guid": "f144bb77-72b1-4030-a0df-9c92746a843a",
    "name": "eiusmod nulla sit",
    "brand": "GADTRON",
    "descShort": "Officia Lorem exercitation minim eiusmod voluptate adipisicing ad.",
    "descFull":
      "Irure deserunt adipisicing id cupidatat voluptate. Tempor culpa qui dolor ullamco amet commodo consequat veniam elit. Est qui officia magna anim reprehenderit cillum nulla est esse.\n\nAute esse velit anim incididunt officia proident sint quis esse sint esse eu laboris aliqua. Commodo consequat velit ipsum duis eu non mollit qui ullamco elit. Quis labore officia irure in exercitation do magna non nostrud do officia. Proident ex eiusmod non ut proident veniam ex. Officia velit id quis commodo consectetur esse eiusmod eu in veniam cupidatat laboris. Elit eiusmod mollit id culpa deserunt duis dolore minim cillum aliquip dolore do adipisicing consectetur. Minim fugiat ad nulla veniam ipsum non nulla duis commodo ea.\n\nCulpa exercitation tempor magna nisi et dolor consequat veniam. Consectetur excepteur ea ut consequat labore. Id voluptate enim elit excepteur.",
    "isFavourite": true,
    "rating": 1,
    "price": "$107.34",
    "oldPrice": "$635.52",
    "savings": "$7.53",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "xl"
  },
  {
    "_id": "5af6ac50857bd601c41a90c4",
    "index": 9,
    "guid": "cf8a72c1-eb22-425e-80f8-835469b933cd",
    "name": "ipsum magna proident",
    "brand": "ENDIPIN",
    "descShort": "Nostrud pariatur ut amet anim sunt aliquip magna voluptate dolore.",
    "descFull":
      "Proident amet amet ea aute Lorem exercitation incididunt. Nisi reprehenderit deserunt dolore nisi eu irure dolor. Qui dolor adipisicing id aute deserunt.\n\nExcepteur mollit laboris do nisi fugiat consequat proident aute. Officia id consequat eiusmod eiusmod eu anim. Incididunt veniam nulla duis non quis voluptate fugiat minim.\n\nAmet commodo exercitation adipisicing sit voluptate velit reprehenderit aliqua laboris aute aliquip velit. Ad deserunt qui anim cillum tempor nisi deserunt. Consectetur excepteur minim ea laboris magna reprehenderit id nostrud exercitation enim aliqua. Irure velit ea ullamco esse cillum qui eiusmod Lorem adipisicing adipisicing et aute. Officia do dolore occaecat id. Cupidatat occaecat qui sit velit consectetur id ex id minim. Pariatur eu eiusmod nisi commodo fugiat excepteur.",
    "isFavourite": true,
    "rating": 4,
    "price": "$118.50",
    "oldPrice": "$572.07",
    "savings": "$7.07",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "m"
  },
  {
    "_id": "5af6ac509734c3913b641d9d",
    "index": 10,
    "guid": "0a237ece-c343-45c0-b304-64a706aee0c6",
    "name": "culpa amet ex",
    "brand": "PROXSOFT",
    "descShort": "Anim minim anim aliquip ullamco Lorem ullamco ut tempor commodo tempor.",
    "descFull":
      "Cillum sunt aute laborum laboris proident culpa. Occaecat elit elit ullamco sunt cupidatat tempor ea labore excepteur enim commodo laborum commodo ipsum. Enim fugiat labore sunt est qui exercitation culpa culpa aliquip. Et labore laboris fugiat esse amet do dolore dolor duis voluptate.\n\nCommodo nisi ipsum aute amet voluptate occaecat reprehenderit. Mollit nostrud aute aliqua fugiat velit in. Adipisicing fugiat ipsum ullamco pariatur non. Deserunt exercitation nostrud pariatur enim ea ipsum labore quis. Deserunt ullamco laborum cupidatat ea eu exercitation voluptate amet sint quis culpa. Veniam cillum proident cupidatat fugiat adipisicing in in sunt incididunt anim eu.\n\nCillum dolore laboris sit incididunt occaecat commodo. Sit ut ipsum consequat irure aute veniam voluptate magna laborum laborum officia ex aliquip. Laborum exercitation aute anim aute mollit duis mollit nostrud. Culpa magna cillum ipsum laboris minim. Et est magna cillum aliquip anim culpa mollit esse veniam aliquip incididunt enim. Pariatur nulla reprehenderit velit excepteur occaecat ea ipsum do. Laboris non laboris adipisicing ea enim amet adipisicing commodo in dolore cupidatat ipsum.",
    "isFavourite": true,
    "rating": 1,
    "price": "$389.86",
    "oldPrice": "$824.58",
    "savings": "$82.61",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "l"
  },
  {
    "_id": "5af6ac50097168d1c3cb1980",
    "index": 11,
    "guid": "c905d406-9c7d-4798-ad57-9f8e601cb476",
    "name": "ex ad ut",
    "brand": "CORMORAN",
    "descShort": "Dolore non enim cupidatat anim eu proident deserunt elit ad incididunt Lorem ea.",
    "descFull":
      "Proident ut nulla ullamco enim cillum ex esse aliqua amet est occaecat. Culpa reprehenderit culpa occaecat irure anim sunt duis est duis. Tempor irure deserunt proident aute labore exercitation incididunt pariatur cillum exercitation excepteur consectetur.\n\nDeserunt reprehenderit consequat cupidatat nisi fugiat anim elit ut consequat qui nostrud consectetur voluptate sint. Officia laborum velit occaecat sit est amet nisi ut esse voluptate duis dolor dolor. Cupidatat amet mollit proident fugiat aliquip Lorem veniam deserunt pariatur veniam ex nulla ad ad.\n\nVoluptate ad cillum eiusmod eu tempor esse Lorem mollit qui eiusmod laboris Lorem quis exercitation. Qui laborum officia non officia magna ullamco dolor consequat eu ut voluptate laborum in elit. Aute sit ut incididunt mollit non dolor ipsum excepteur velit ullamco qui. Culpa cupidatat aliquip laboris tempor cillum ex enim eu quis amet cillum ea. Do quis nisi sit labore in tempor nulla dolore do sunt incididunt amet. Anim ut non consequat qui non. Tempor est tempor cupidatat nostrud aute eiusmod enim.",
    "isFavourite": false,
    "rating": 4,
    "price": "$237.62",
    "oldPrice": "$541.80",
    "savings": "$49.32",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "xl"
  },
  {
    "_id": "5af6ac5021d69e1005622ec6",
    "index": 12,
    "guid": "44e5a7c1-4a97-40dc-a8c2-bc8a03675c79",
    "name": "aliquip eu fugiat",
    "brand": "TINGLES",
    "descShort": "Eiusmod minim voluptate deserunt et nisi proident esse enim tempor duis dolore laboris sint.",
    "descFull":
      "Commodo non quis culpa laborum quis fugiat laboris. Ea ad consectetur sint labore ipsum consequat tempor amet amet voluptate cupidatat. Consectetur et laboris est nulla sunt sit eu minim.\n\nSunt culpa tempor Lorem qui. Sunt adipisicing aute nostrud et. Nulla pariatur elit ut deserunt culpa consequat pariatur consequat ipsum. Fugiat cillum non minim velit nostrud labore nulla incididunt esse ut duis dolore ad. Elit reprehenderit officia nostrud id. Consequat pariatur eiusmod ut mollit minim cupidatat enim eu.\n\nCulpa proident deserunt elit labore aliquip elit qui aliqua anim cupidatat veniam id consectetur. Fugiat aliqua adipisicing est fugiat. Consequat nostrud cillum aliqua occaecat do eu esse exercitation aliqua aute Lorem officia. Nulla duis nostrud ea veniam deserunt nostrud.",
    "isFavourite": true,
    "rating": 4,
    "price": "$371.16",
    "oldPrice": "$914.08",
    "savings": "$96.04",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "s"
  },
  {
    "_id": "5af6ac50b9e564b056be9a00",
    "index": 13,
    "guid": "53d2e8af-f5ef-4eef-aa87-b87428e1c92c",
    "name": "non reprehenderit ex",
    "brand": "COSMETEX",
    "descShort": "Officia ut sunt laboris in deserunt do consequat est mollit sit aute veniam.",
    "descFull":
      "Labore minim voluptate nisi laborum est incididunt irure velit aute cupidatat. In id non duis commodo deserunt eiusmod. Minim veniam voluptate proident voluptate nulla et. Consectetur nisi occaecat esse do dolore aute sunt qui occaecat duis. Culpa id id reprehenderit ipsum reprehenderit esse cillum sint fugiat dolore quis. Culpa esse cillum aute enim magna amet.\n\nSint excepteur aliquip veniam proident elit mollit. Aliquip veniam culpa ipsum magna deserunt sit. Eu eiusmod laboris nisi eu consequat commodo occaecat adipisicing pariatur. Incididunt adipisicing laborum ut cupidatat. Aliquip est consectetur occaecat ullamco nulla. Esse amet nisi aliquip ullamco duis dolor cillum fugiat dolore ullamco. Enim velit reprehenderit mollit aliquip sit exercitation nulla est eu sunt.\n\nAliqua reprehenderit reprehenderit in ex velit deserunt aliqua duis. Nisi dolore ad amet ad dolor aliqua. Ut aute dolor occaecat ullamco excepteur. Ad Lorem minim ex elit ex. Esse do ipsum sit ipsum non occaecat. Magna qui ut anim velit consequat anim id ad aliquip ullamco quis Lorem eu ex. Labore fugiat laboris laboris cillum nulla nisi est fugiat tempor adipisicing exercitation consectetur qui.",
    "isFavourite": true,
    "rating": 4,
    "price": "$115.01",
    "oldPrice": "$763.72",
    "savings": "$26.61",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "xl"
  },
  {
    "_id": "5af6ac500b1078d79b676362",
    "index": 14,
    "guid": "49e37669-008c-41d8-9680-50ade5d682fa",
    "name": "non magna eiusmod",
    "brand": "CIPROMOX",
    "descShort": "Elit sint ipsum duis veniam est.",
    "descFull":
      "Duis ex mollit incididunt adipisicing officia ipsum. Nostrud dolor Lorem commodo in. Pariatur deserunt voluptate ad ipsum dolor id exercitation enim anim. Eiusmod mollit sunt excepteur esse minim fugiat reprehenderit enim in aute eiusmod sunt. Laborum adipisicing proident aliquip commodo incididunt do voluptate incididunt et anim. Eiusmod tempor excepteur mollit esse reprehenderit ea anim enim in elit minim duis do irure.\n\nAliquip adipisicing nostrud reprehenderit adipisicing eu esse cillum cupidatat consectetur proident. Non culpa duis pariatur laboris. Magna excepteur qui tempor magna commodo commodo eu ad proident. Irure consectetur exercitation tempor eu quis sint quis aliqua. Tempor irure qui veniam veniam ex exercitation ad mollit labore amet quis do.\n\nCillum nostrud exercitation mollit incididunt minim est id exercitation. Laboris aliquip eiusmod nulla proident ut. Ut aliqua pariatur elit do cillum nostrud veniam veniam.",
    "isFavourite": true,
    "rating": 2,
    "price": "$103.28",
    "oldPrice": "$876.85",
    "savings": "$71.05",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "xl"
  },
  {
    "_id": "5af6ac50c2aada925bbfddf1",
    "index": 15,
    "guid": "db07679a-aa0f-43ab-9fd4-f94dee229fe6",
    "name": "commodo nisi labore",
    "brand": "AEORA",
    "descShort": "Nisi Lorem ipsum voluptate officia.",
    "descFull":
      "Proident pariatur labore consequat adipisicing eiusmod. Fugiat exercitation dolor duis veniam anim Lorem ea culpa. Aliqua cupidatat commodo voluptate elit reprehenderit nulla anim irure. Culpa culpa enim mollit et aliquip sint proident nulla duis exercitation nulla.\n\nEnim aute commodo duis ipsum. Irure sint nostrud nostrud irure officia ex anim enim dolore anim id pariatur. Nisi fugiat pariatur non non nisi et mollit ullamco irure ipsum nisi commodo. Laboris aute culpa commodo sunt adipisicing excepteur cupidatat labore qui. Qui incididunt ut pariatur aliqua dolore in. Officia aute tempor aute aliqua fugiat quis proident. Minim minim qui consequat culpa laborum.\n\nAdipisicing proident nisi officia duis culpa labore. Aliquip anim incididunt nisi esse consequat deserunt incididunt eiusmod irure. Consectetur ea dolor irure dolor pariatur sint. Consectetur amet adipisicing quis occaecat.",
    "isFavourite": false,
    "rating": 5,
    "price": "$123.17",
    "oldPrice": "$974.38",
    "savings": "$19.08",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "m"
  },
  {
    "_id": "5af6ac505a0b35af90b0ac02",
    "index": 16,
    "guid": "b8e1d194-ed42-4e41-98ea-2de9a39242af",
    "name": "aliqua tempor aliqua",
    "brand": "PODUNK",
    "descShort": "Irure adipisicing eiusmod ea elit enim qui consequat exercitation est cupidatat quis elit elit laborum.",
    "descFull":
      "Ipsum pariatur ipsum laborum cillum reprehenderit. Id nulla irure labore magna nostrud eiusmod voluptate cillum do qui proident do magna deserunt. Ipsum eiusmod aliqua laborum ullamco minim proident pariatur eu amet ut ut. Velit cillum velit sunt proident. Ex ullamco sunt culpa non proident laboris sunt elit elit sunt labore pariatur Lorem.\n\nEsse laboris proident sunt amet ipsum minim. Minim non elit veniam sint esse. Nulla aliqua dolor consequat ipsum Lorem officia minim excepteur cupidatat officia nostrud. Veniam aliqua ea dolor qui. Ex consequat in enim aute anim labore. Occaecat ex dolore consectetur anim excepteur minim laborum. Eiusmod deserunt Lorem minim consectetur occaecat aute nisi velit sint commodo voluptate tempor sit fugiat.\n\nLabore est quis irure nisi commodo sint eiusmod. Veniam proident dolore quis reprehenderit. Quis nulla cupidatat nostrud est sint dolore incididunt commodo reprehenderit sunt do. Enim cupidatat nostrud consectetur reprehenderit deserunt deserunt ad. Ullamco nulla labore ullamco Lorem veniam dolor veniam nisi excepteur aliqua ea sint dolor aliqua. Irure esse adipisicing pariatur ad qui irure Lorem dolor.",
    "isFavourite": false,
    "rating": 4,
    "price": "$181.44",
    "oldPrice": "$583.27",
    "savings": "$13.94",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "s"
  },
  {
    "_id": "5af6ac50526d7b706d9cf5a4",
    "index": 17,
    "guid": "6ca9c32b-8be2-4222-8e70-271b11eac2fd",
    "name": "quis nostrud nostrud",
    "brand": "QUARX",
    "descShort": "Duis fugiat reprehenderit sit cupidatat ipsum consectetur deserunt nulla proident.",
    "descFull":
      "Ut do aute in incididunt officia irure nisi est proident dolore aute consequat est velit. Nulla enim dolore fugiat qui excepteur exercitation dolore occaecat ea laborum elit cupidatat sint. Qui incididunt voluptate aute quis laboris ex reprehenderit Lorem enim esse incididunt irure aliquip ad. Consectetur aliquip enim dolore dolor.\n\nDuis aliqua ea Lorem id irure laboris fugiat cillum nostrud do nulla aliquip consequat tempor. Et reprehenderit veniam laborum et eu aute ad non consectetur. Anim aute do sint culpa consectetur in aliqua qui consequat esse tempor ipsum consectetur. Magna eiusmod occaecat deserunt ea qui proident laboris nostrud pariatur magna voluptate elit. Exercitation ex et dolore ipsum occaecat ipsum magna ut cupidatat tempor dolor. Adipisicing proident voluptate occaecat dolore minim ex aliqua esse aliquip ad veniam sit elit. Ad esse enim aute excepteur ipsum.\n\nEnim Lorem aliquip enim ut aute qui deserunt ex occaecat nisi. Pariatur laboris in commodo ipsum labore enim dolor velit ullamco nulla sit velit ex pariatur. Consectetur cupidatat est amet proident deserunt ea. Eu commodo eiusmod adipisicing nisi in ad cupidatat.",
    "isFavourite": true,
    "rating": 1,
    "price": "$327.48",
    "oldPrice": "$954.14",
    "savings": "$34.15",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "s"
  },
  {
    "_id": "5af6ac5028646c9c4d146cf6",
    "index": 18,
    "guid": "97b7af1c-2f6d-4daa-ab47-371a1f242df1",
    "name": "mollit ut labore",
    "brand": "RECOGNIA",
    "descShort": "Tempor velit commodo voluptate do tempor reprehenderit voluptate velit nostrud sint enim cillum eiusmod.",
    "descFull":
      "Sit proident cupidatat minim anim velit pariatur. Ea non amet in nulla qui commodo fugiat labore nisi duis quis duis minim elit. Excepteur irure officia ipsum duis.\n\nAute mollit nostrud occaecat Lorem officia ea sint pariatur. Cupidatat in exercitation non non. Cillum et do duis eu reprehenderit aute non officia. Adipisicing dolore id officia enim dolor ex est consequat officia est laboris anim. Do culpa et incididunt ex quis enim tempor amet. Quis cillum tempor duis voluptate anim proident. Nulla minim nisi elit elit aliquip quis esse ullamco officia excepteur in.\n\nExercitation nulla minim sint fugiat esse enim commodo ullamco aute veniam tempor est magna. Nostrud eiusmod Lorem ipsum cupidatat irure. Ullamco dolore ut Lorem commodo sunt eiusmod mollit non occaecat sit reprehenderit esse.",
    "isFavourite": true,
    "rating": 1,
    "price": "$348.09",
    "oldPrice": "$973.96",
    "savings": "$63.67",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "xl"
  },
  {
    "_id": "5af6ac50c6dbda0a39c60459",
    "index": 19,
    "guid": "139c1880-9249-495a-a65b-46f003354609",
    "name": "eu sit Lorem",
    "brand": "NAMEGEN",
    "descShort": "Do proident cillum ut exercitation laborum labore officia proident irure.",
    "descFull":
      "Nulla aute proident consequat aute nisi proident elit labore officia ullamco non occaecat. Exercitation exercitation id incididunt proident occaecat sint quis ex nulla magna et magna. Voluptate et voluptate sunt amet nostrud eu consectetur anim ipsum officia. Ullamco excepteur occaecat irure deserunt eiusmod nisi cillum eu ullamco enim voluptate. Officia elit deserunt ex mollit deserunt excepteur. Reprehenderit consequat non adipisicing anim ad pariatur et Lorem irure dolore amet. Enim qui est enim fugiat reprehenderit ipsum eu id Lorem qui excepteur consectetur culpa.\n\nAliqua aliqua adipisicing excepteur ad. Aliquip ut consectetur occaecat et sit deserunt. Elit id officia excepteur tempor fugiat dolore dolore ex. Esse pariatur veniam consequat ex ea magna culpa aliquip non excepteur nisi.\n\nVeniam ipsum nisi ad ut ad. Laborum enim cupidatat dolore minim voluptate eiusmod do non nulla mollit aliquip. Sunt enim labore eu ut est cillum minim tempor anim irure.",
    "isFavourite": true,
    "rating": 5,
    "price": "$261.39",
    "oldPrice": "$443.97",
    "savings": "$62.78",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "s"
  },
  {
    "_id": "5af6ac5073b2071aadc72bd6",
    "index": 20,
    "guid": "b026f942-e5bb-4f29-812b-bbfb18512678",
    "name": "est proident adipisicing",
    "brand": "ORBIFLEX",
    "descShort": "Officia consequat laborum non sint aliqua voluptate est eiusmod cillum non deserunt sunt ex.",
    "descFull":
      "Est deserunt commodo cupidatat amet laboris anim aliquip eiusmod veniam tempor. Duis fugiat consectetur ad labore fugiat adipisicing adipisicing enim voluptate do nulla. Ea dolor voluptate aute est ipsum dolor fugiat ipsum pariatur. Officia anim aute amet incididunt pariatur irure commodo. Ad eiusmod in fugiat veniam magna reprehenderit laboris.\n\nEsse aute ut anim minim. Dolor nulla amet et pariatur do quis. Et ullamco dolor non pariatur amet cupidatat ullamco nulla occaecat duis esse.\n\nFugiat velit nostrud fugiat fugiat. Voluptate dolore non incididunt commodo mollit consequat voluptate est consectetur. Minim do irure quis dolore aliqua duis Lorem est minim Lorem culpa. Pariatur elit labore non cupidatat dolor. Occaecat est in Lorem quis ipsum pariatur dolore adipisicing. Excepteur culpa laborum voluptate consequat pariatur sunt.",
    "isFavourite": false,
    "rating": 2,
    "price": "$137.45",
    "oldPrice": "$874.18",
    "savings": "$31.74",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "xl"
  },
  {
    "_id": "5af6ac50e085f5ee5fb84d13",
    "index": 21,
    "guid": "07f4436a-69f9-48cb-b96b-a9f7e9e612fc",
    "name": "eu pariatur reprehenderit",
    "brand": "JAMNATION",
    "descShort": "Nostrud magna elit proident mollit in cillum culpa cillum Lorem.",
    "descFull":
      "Officia consequat sunt amet aute pariatur quis quis sunt dolore sint amet tempor aute. Nisi excepteur ad dolore nulla sint tempor duis esse pariatur laboris irure Lorem velit. Excepteur adipisicing proident tempor proident adipisicing aute proident do ipsum anim dolor. Magna est id ullamco non nostrud fugiat ad id deserunt exercitation nostrud. Ea exercitation eiusmod nisi qui esse duis laborum minim in adipisicing irure minim. Labore sit esse adipisicing ea. Ex magna voluptate do cillum minim duis ipsum do laborum do elit aliqua mollit.\n\nDuis consequat aliquip adipisicing deserunt consequat ut ea esse eu excepteur dolor ipsum pariatur. Labore enim officia in consectetur sit ex. Irure proident laboris esse laboris commodo exercitation culpa consectetur excepteur dolor ullamco in non. Ad proident mollit nisi tempor in cupidatat id reprehenderit nulla labore consectetur nisi et dolore. Ipsum qui est sint aliquip duis occaecat. Amet labore est ut Lorem amet ad id proident do eiusmod.\n\nConsectetur qui do laboris occaecat tempor veniam elit excepteur tempor dolore magna. Sunt voluptate dolore aute ea. Excepteur minim fugiat laborum labore eiusmod occaecat. Pariatur elit cupidatat eu qui id sunt deserunt ex duis.",
    "isFavourite": false,
    "rating": 3,
    "price": "$283.94",
    "oldPrice": "$557.99",
    "savings": "$71.55",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "m"
  },
  {
    "_id": "5af6ac50969f8733a938612f",
    "index": 22,
    "guid": "1131679b-e849-45af-9eb7-0ba23aa4b0c0",
    "name": "amet labore voluptate",
    "brand": "INSURON",
    "descShort": "Ullamco proident dolore qui consectetur sint nulla consectetur nisi.",
    "descFull":
      "Voluptate ex exercitation esse Lorem laborum esse. Deserunt minim Lorem ullamco qui enim non adipisicing non labore sit reprehenderit ut reprehenderit aliquip. Aute sint consequat aliquip laboris. Ad nisi elit dolor duis sint anim nulla ut. Officia ea enim elit ex anim reprehenderit. Pariatur nulla magna et sint in. Sunt fugiat eiusmod sunt adipisicing.\n\nNisi id non fugiat duis anim aute esse magna dolor. Duis non amet laborum pariatur adipisicing anim in ut consectetur occaecat sit. Excepteur labore esse enim duis Lorem reprehenderit quis velit consequat amet. Deserunt eu tempor excepteur id mollit est cillum id occaecat dolore aliquip incididunt minim elit. Voluptate proident magna in consectetur adipisicing do est proident ex. Ad adipisicing ullamco voluptate qui magna.\n\nDolor consequat ex deserunt proident laboris. Dolor ut adipisicing amet reprehenderit qui ea adipisicing enim et laboris proident id laboris. Cillum veniam adipisicing minim pariatur dolore. Lorem velit ullamco laborum exercitation Lorem velit aute.",
    "isFavourite": true,
    "rating": 5,
    "price": "$292.09",
    "oldPrice": "$916.09",
    "savings": "$32.21",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "m"
  },
  {
    "_id": "5af6ac50e651148dffc8a0f9",
    "index": 23,
    "guid": "3d4dc987-39d9-4b39-9d51-efdb3e2db5ba",
    "name": "sunt consectetur pariatur",
    "brand": "ZILLACON",
    "descShort": "Eu veniam non cupidatat exercitation aute ut sunt officia mollit elit id.",
    "descFull": "Cupidatat laboris mollit officia sit amet. Lorem reprehenderit ullamco eiusmod magna ea nostrud minim nisi occaecat. Pariatur labore fugiat cupidatat exercitation nisi aliqua nulla amet id.\n\nLabore aliquip in in nisi sit tempor officia nisi laboris elit et. Dolor deserunt laborum adipisicing aute occaecat voluptate laborum excepteur laborum Lorem excepteur aute. Ipsum aute aute dolor duis commodo.\n\nUllamco cillum excepteur amet adipisicing quis laboris incididunt et sint. Eiusmod sit aliqua labore quis sint aute velit est quis nisi laboris fugiat cillum sunt. Laboris Lorem nulla ea anim aliqua in occaecat velit. Reprehenderit ex exercitation dolore deserunt ex et ullamco ut officia ea quis.",
    "isFavourite": false,
    "rating": 5,
    "price": "$216.59",
    "oldPrice": "$451.91",
    "savings": "$41.31",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "l"
  },
  {
    "_id": "5af6ac5011b450f0600837ca",
    "index": 24,
    "guid": "b922635c-bb08-46f0-91b2-9a07d47a784f",
    "name": "est esse pariatur",
    "brand": "KENGEN",
    "descShort": "Deserunt reprehenderit id cillum dolor fugiat duis culpa anim sunt do id.",
    "descFull":
      "Elit proident sint do consectetur sunt ullamco proident. Ea commodo ullamco ex ad cupidatat aute ullamco ex aliqua cillum dolore aliquip. In est amet est nostrud ex elit consectetur sint. Aliquip minim incididunt do mollit irure nulla consectetur duis ex est. In sunt quis minim ea officia dolor labore cillum magna duis enim Lorem amet.\n\nQui pariatur laborum exercitation voluptate excepteur non ad amet nulla cupidatat. Voluptate fugiat amet sint quis ad ut ad labore sunt. Nostrud excepteur voluptate sit id officia adipisicing fugiat elit occaecat quis labore sit. Esse laboris ipsum cupidatat quis commodo veniam. Nostrud magna veniam ex aliqua. Fugiat incididunt ipsum consequat occaecat velit est laboris consequat. Cillum nostrud amet labore consectetur exercitation deserunt amet dolor cupidatat deserunt in labore anim.\n\nQuis fugiat consequat laborum consectetur elit nostrud sunt ea amet. Nostrud nisi laborum ex aliqua. Adipisicing ipsum in ea qui pariatur ex reprehenderit consectetur eu culpa. Voluptate ipsum ex laborum sit enim id ex.",
    "isFavourite": true,
    "rating": 1,
    "price": "$224.21",
    "oldPrice": "$683.68",
    "savings": "$98.44",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "m"
  },
  {
    "_id": "5af6ac50dc39e47707f1b0c9",
    "index": 25,
    "guid": "1bc065b7-9fc8-483a-8fdf-f7b04564380b",
    "name": "in in sint",
    "brand": "GEEKWAGON",
    "descShort": "Labore pariatur deserunt aliquip fugiat.",
    "descFull":
      "Quis irure deserunt aliquip aute magna do eiusmod qui nisi. Consequat eu incididunt excepteur nisi labore enim eiusmod. Commodo adipisicing velit labore anim culpa labore enim. Cillum reprehenderit tempor laborum cillum eu ut laboris cillum aliqua irure minim. Duis ipsum qui consectetur ipsum. Cillum cupidatat ea eu id laborum tempor veniam ex commodo est amet id. Minim consequat voluptate sint anim duis aute duis.\n\nPariatur aliquip mollit veniam excepteur voluptate non proident qui culpa laboris exercitation. Lorem et irure minim irure esse nisi Lorem ullamco anim nostrud. Non excepteur pariatur qui labore eiusmod.\n\nDolore sit proident Lorem est qui labore ipsum minim id eu qui exercitation. Occaecat tempor laborum aute sit ea deserunt ullamco mollit. In eiusmod nostrud duis labore dolor ut aliqua aliquip do do consectetur Lorem aliquip nostrud. Enim et proident ex sint commodo mollit ad qui ut. Pariatur dolore sint ad proident do proident. Eu magna quis reprehenderit occaecat sint laboris excepteur et sit incididunt.",
    "isFavourite": true,
    "rating": 3,
    "price": "$226.91",
    "oldPrice": "$712.01",
    "savings": "$59.34",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "m"
  },
  {
    "_id": "5af6ac5043eabba878ea549a",
    "index": 26,
    "guid": "ead2e499-a1bf-405f-80aa-2c3200b84623",
    "name": "qui laborum quis",
    "brand": "VENOFLEX",
    "descShort": "Duis ipsum cupidatat voluptate incididunt nostrud in.",
    "descFull":
      "Deserunt exercitation mollit ipsum id Lorem consectetur ex aliqua anim eu sit. Sit quis magna qui qui nulla labore. Reprehenderit cupidatat laborum excepteur et do excepteur Lorem incididunt.\n\nMagna consequat sint in tempor exercitation. Non tempor magna sunt labore. Minim proident cillum elit excepteur et. Qui consectetur laboris adipisicing anim duis minim eu. Ex voluptate consectetur fugiat nulla tempor dolor. Esse proident officia enim adipisicing mollit ut.\n\nId irure aliqua quis dolor excepteur commodo adipisicing cillum tempor magna officia ullamco deserunt. Nisi ex quis ipsum reprehenderit laborum cillum ad laboris ad anim dolor culpa. Anim commodo velit sunt amet do qui amet adipisicing. Deserunt consequat eiusmod et adipisicing dolor enim. Duis commodo sint minim tempor esse amet. Amet sit id commodo proident est mollit eu aliquip aute laborum.",
    "isFavourite": false,
    "rating": 5,
    "price": "$350.77",
    "oldPrice": "$752.50",
    "savings": "$68.36",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "xl"
  },
  {
    "_id": "5af6ac50528c322a9a60141c",
    "index": 27,
    "guid": "ae8b943c-e511-404c-909b-55afa77f5b58",
    "name": "fugiat consequat occaecat",
    "brand": "SCENTRIC",
    "descShort": "Cupidatat pariatur in ad officia enim deserunt.",
    "descFull":
      "Magna exercitation esse qui enim duis fugiat ullamco proident non non enim minim excepteur. Quis nostrud dolor consectetur pariatur incididunt enim ex non eiusmod adipisicing laborum. Qui exercitation minim aliquip esse irure qui nisi fugiat excepteur in minim labore id. Reprehenderit cillum magna ut laborum aliquip culpa non. Proident in irure commodo enim nulla adipisicing. Deserunt ipsum pariatur elit ea do mollit excepteur. Reprehenderit reprehenderit qui minim elit est eu ex dolor laboris culpa.\n\nDeserunt qui Lorem ullamco dolore nulla nisi. Velit esse est velit laborum. Irure voluptate anim aliqua reprehenderit excepteur. Sit nostrud est irure aliqua nostrud culpa pariatur id reprehenderit. Adipisicing id laboris irure do voluptate cillum ut sunt ad. Sit veniam ullamco anim in ipsum quis irure minim.\n\nDolore ex ea aliqua enim ipsum culpa consectetur voluptate quis esse. Occaecat nisi occaecat ex labore irure veniam. Sint enim commodo adipisicing anim mollit dolore laboris veniam cupidatat. Eu magna consequat culpa tempor aliquip ipsum consequat aliquip pariatur ullamco esse do cupidatat dolore.",
    "isFavourite": true,
    "rating": 2,
    "price": "$104.50",
    "oldPrice": "$511.67",
    "savings": "$67.87",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "m"
  },
  {
    "_id": "5af6ac50b789a87ebb2a2c86",
    "index": 28,
    "guid": "7f2c60f2-aa75-4c12-820a-ffcf756b3f38",
    "name": "et laborum culpa",
    "brand": "GOKO",
    "descShort": "Ad nisi incididunt cupidatat ullamco do anim excepteur eiusmod irure mollit aute.",
    "descFull":
      "Excepteur reprehenderit culpa occaecat deserunt pariatur id mollit mollit ullamco deserunt eiusmod. Duis irure Lorem consectetur Lorem aliquip exercitation. Ipsum elit officia eu veniam non laborum pariatur aliquip dolor. Aliqua ad non labore aliqua in eu labore proident pariatur mollit. Quis ad cillum nisi Lorem tempor quis duis est aliqua qui officia minim ut. Anim magna culpa adipisicing occaecat quis dolor proident aliquip mollit anim.\n\nAmet ut aliquip anim ex ad cillum est quis enim aliquip aliqua. Aliquip qui commodo id sit cillum culpa velit commodo. Ullamco exercitation nulla eiusmod fugiat nisi ea incididunt dolore duis ipsum excepteur excepteur anim. Nostrud enim laboris ad dolor fugiat sint cupidatat velit nulla et Lorem. Proident do fugiat ipsum consectetur tempor consectetur aliquip officia ipsum nisi. Incididunt nisi ad irure ex adipisicing quis dolor sunt reprehenderit.\n\nLabore commodo elit duis quis nulla ea nostrud ullamco. Mollit in duis deserunt proident. Voluptate laboris qui veniam voluptate officia ipsum occaecat occaecat aliqua magna consectetur eu aute proident. Consectetur non excepteur mollit esse ad velit nulla. Commodo sit enim esse sint deserunt dolore.",
    "isFavourite": true,
    "rating": 2,
    "price": "$298.73",
    "oldPrice": "$544.47",
    "savings": "$69.21",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "l"
  },
  {
    "_id": "5af6ac50c0fb5504a03ee243",
    "index": 29,
    "guid": "5d602458-d574-47cb-9ad5-8f064632345d",
    "name": "cillum minim consequat",
    "brand": "GENMY",
    "descShort": "Ad dolore commodo ut dolor quis quis aliqua pariatur ea dolor officia sit.",
    "descFull":
      "Excepteur laborum Lorem sint esse occaecat consectetur enim Lorem aliquip laborum aliqua mollit eu duis. Est ad cupidatat eu incididunt incididunt ea consequat. Magna reprehenderit officia elit excepteur ipsum laboris laboris sunt. Amet ex excepteur do enim.\n\nConsequat ea laboris amet duis. Ea mollit consequat voluptate dolore consectetur. Fugiat voluptate minim nisi Lorem pariatur eiusmod. Consectetur consequat voluptate nisi ex aute.\n\nPariatur reprehenderit et consequat tempor fugiat ut ut labore consectetur esse est eiusmod. Officia est enim cupidatat labore aliquip exercitation consequat ullamco exercitation eu esse sunt. Esse aliquip mollit commodo enim. Irure fugiat commodo laboris aute. Sint ad qui nulla laboris eiusmod in magna dolore commodo. Elit ea incididunt culpa aliqua eu quis proident.",
    "isFavourite": true,
    "rating": 2,
    "price": "$381.03",
    "oldPrice": "$731.50",
    "savings": "$14.98",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "m"
  },
  {
    "_id": "5af6ac5013144b9eb5f526e0",
    "index": 30,
    "guid": "a9da5a39-d5b9-44de-87f4-d28d7afcee3f",
    "name": "laborum consequat aute",
    "brand": "EZENTIA",
    "descShort": "Dolor consectetur mollit sunt consequat.",
    "descFull":
      "Commodo esse ipsum aute aliquip mollit velit eiusmod et. Quis mollit non sit laborum mollit amet aute. Anim minim quis irure amet veniam laboris. Dolor officia enim tempor sunt in esse ea.\n\nReprehenderit cillum aliquip eiusmod veniam do. Proident ullamco elit occaecat culpa ad enim consectetur et. Esse elit exercitation dolor velit eiusmod irure proident eu fugiat tempor elit fugiat veniam. Consequat dolor id reprehenderit ex nulla amet voluptate sit labore cupidatat. Amet ad labore culpa aliqua esse. Reprehenderit veniam mollit cillum voluptate nostrud officia id nisi. Non consequat sint elit laborum enim nulla anim.\n\nIncididunt mollit nostrud fugiat aliqua laboris id do. Sunt nisi cillum magna consectetur non minim ea fugiat aliquip ut deserunt. Dolore occaecat ad in fugiat consectetur enim exercitation. Aliqua velit dolor officia dolor aliqua quis cillum cupidatat aute est tempor occaecat adipisicing aliqua. Magna laborum laborum id laborum veniam aute nisi incididunt eiusmod id.",
    "isFavourite": true,
    "rating": 4,
    "price": "$250.08",
    "oldPrice": "$852.60",
    "savings": "$9.89",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "m"
  },
  {
    "_id": "5af6ac50686416d720c0d9ad",
    "index": 31,
    "guid": "70dc10ed-76bb-47d2-ac9e-45d5e3a364b2",
    "name": "dolor proident non",
    "brand": "AVIT",
    "descShort": "Voluptate eu amet incididunt Lorem eiusmod non dolor Lorem.",
    "descFull":
      "Proident ipsum minim non ullamco. Non laboris aliqua ut ex incididunt sunt sit irure officia. Sunt sint voluptate veniam fugiat minim cupidatat duis. Id ullamco proident adipisicing anim.\n\nConsequat ipsum est in mollit nostrud fugiat. Aliqua pariatur duis anim ut esse qui ullamco enim. Anim pariatur laborum sint labore commodo dolor. Sit non dolore dolore minim.\n\nPariatur eu irure anim labore qui do aute velit exercitation consequat eiusmod. Ipsum reprehenderit dolore esse ea do culpa sunt est voluptate nostrud mollit officia. Non dolor ad laborum ea consectetur. Et proident nisi laboris ullamco veniam magna consectetur minim. Esse aliquip duis Lorem officia incididunt dolore esse elit eu voluptate qui et. Deserunt laborum non duis proident excepteur consequat. Excepteur dolore nulla laboris cillum reprehenderit consectetur occaecat commodo.",
    "isFavourite": true,
    "rating": 2,
    "price": "$262.30",
    "oldPrice": "$808.76",
    "savings": "$4.94",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "m"
  },
  {
    "_id": "5af6ac5022557e62941ca5a7",
    "index": 32,
    "guid": "a4d550e5-b460-42c9-9a31-c8cc5eeddd20",
    "name": "magna eiusmod laboris",
    "brand": "ENERFORCE",
    "descShort": "Consectetur et velit amet pariatur tempor aliquip eiusmod commodo magna.",
    "descFull": "Eu laboris consequat in veniam pariatur proident irure et quis. Exercitation laboris proident excepteur quis anim ullamco tempor. Ullamco nostrud deserunt deserunt esse Lorem. Ut tempor duis ad occaecat voluptate mollit Lorem veniam nisi magna quis consectetur.\n\nDo magna ullamco sint ipsum. Laborum anim et ad mollit veniam labore et nulla qui sunt enim mollit incididunt. Aliqua minim sint proident ullamco elit laboris fugiat dolor ea irure.\n\nConsequat veniam proident aliquip exercitation minim amet qui. Ut ut amet voluptate qui. Occaecat anim et qui in sit laboris sit amet adipisicing aute Lorem consectetur ea Lorem.",
    "isFavourite": false,
    "rating": 2,
    "price": "$176.95",
    "oldPrice": "$886.03",
    "savings": "$82.48",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "l"
  },
  {
    "_id": "5af6ac506f3f9711869e989e",
    "index": 33,
    "guid": "d83428dc-e25d-4dde-9c7b-8d23fe2f02b2",
    "name": "consequat consequat mollit",
    "brand": "WEBIOTIC",
    "descShort": "Labore veniam esse nostrud adipisicing.",
    "descFull": "Nulla esse irure laboris cillum elit anim laboris non Lorem ut eiusmod amet. Pariatur quis Lorem dolore duis consectetur magna aute eu. Proident ea consequat minim et sunt ipsum et aliqua eu sint. Mollit do ipsum ipsum do occaecat velit reprehenderit Lorem laborum labore occaecat.\n\nProident deserunt proident incididunt cillum irure dolor aliquip minim ad ipsum. Nostrud magna deserunt dolor ex pariatur et id consectetur voluptate et velit occaecat nisi reprehenderit. Velit nisi veniam aliqua ullamco esse nisi ea sunt aute pariatur ad. Mollit nisi veniam duis in.\n\nUllamco labore proident laboris in. Amet do dolore aliquip exercitation laborum mollit enim proident elit. Culpa cupidatat voluptate consectetur duis nulla.",
    "isFavourite": true,
    "rating": 2,
    "price": "$366.15",
    "oldPrice": "$844.18",
    "savings": "$18.97",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "l"
  },
  {
    "_id": "5af6ac502176582ad87e55a1",
    "index": 34,
    "guid": "85f05f38-ce04-4c2b-a219-77397d772897",
    "name": "do esse nostrud",
    "brand": "KIGGLE",
    "descShort": "Proident magna commodo quis est ullamco qui consectetur.",
    "descFull":
      "Magna aute officia ullamco veniam qui excepteur sit aliqua sunt labore occaecat tempor elit. Est esse esse pariatur Lorem aliqua elit tempor. Ut est dolore magna ipsum minim commodo et enim minim sint incididunt est. Velit Lorem ea occaecat laborum. Nostrud veniam id anim aliquip duis ea nisi anim adipisicing. Veniam laboris eiusmod voluptate duis dolor tempor ipsum adipisicing cillum eu magna sunt sint eu. Nostrud tempor sunt in dolore est consectetur cupidatat proident anim culpa ad laboris.\n\nAliqua nulla pariatur commodo do mollit elit anim sint nulla qui aute voluptate ad. Nostrud qui dolore ad laboris anim. Sit officia id cillum in non nostrud.\n\nDeserunt excepteur nisi veniam excepteur pariatur cillum minim magna veniam consectetur in Lorem. Non ullamco aliquip voluptate dolore et laborum est excepteur. Cillum adipisicing anim ad do consectetur nisi reprehenderit ea. Ad velit nostrud nulla exercitation veniam.",
    "isFavourite": false,
    "rating": 5,
    "price": "$277.96",
    "oldPrice": "$424.40",
    "savings": "$71.18",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "xl"
  },
  {
    "_id": "5af6ac50ab529aa5ca94818b",
    "index": 35,
    "guid": "74883c5c-5559-44ef-8389-bc8027f80f86",
    "name": "ut cillum laboris",
    "brand": "ASIMILINE",
    "descShort": "Laborum minim ut ut nostrud.",
    "descFull":
      "Est ea in aliquip qui eiusmod. Laboris qui dolor commodo minim ullamco qui qui. Cillum commodo dolore anim est anim et occaecat non reprehenderit fugiat nulla. Nisi amet et dolor reprehenderit nulla aliqua non.\n\nFugiat nisi id pariatur qui nulla eiusmod aliquip sint occaecat et occaecat quis. Occaecat proident commodo Lorem eu elit sint commodo sit. Velit fugiat pariatur elit et enim sit qui id. In non ipsum minim do. Excepteur esse nostrud nulla officia mollit. Ut culpa nostrud sint mollit nostrud sunt exercitation. Ex sint velit culpa sint cillum.\n\nDolor adipisicing amet fugiat culpa ut in irure sint est sunt consectetur enim commodo. Excepteur ullamco veniam aliqua proident aliqua est sunt eu labore ex laborum non commodo deserunt. Amet tempor commodo mollit voluptate nulla est eiusmod amet ipsum sint velit consequat magna. Incididunt do dolore et esse minim non laborum duis consectetur ea fugiat. Mollit quis sunt est non aliqua adipisicing exercitation deserunt fugiat consectetur pariatur.",
    "isFavourite": false,
    "rating": 1,
    "price": "$153.93",
    "oldPrice": "$809.60",
    "savings": "$42.88",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "s"
  },
  {
    "_id": "5af6ac50fe0740176d156d00",
    "index": 36,
    "guid": "e225c4b5-b6d6-462b-8af2-d3585cfcd792",
    "name": "consequat deserunt ut",
    "brand": "POLARAX",
    "descShort": "Sit pariatur adipisicing nisi consequat minim ea.",
    "descFull":
      "Nostrud sint cupidatat commodo laboris mollit ullamco eu reprehenderit. Nulla velit veniam culpa est aliqua in cillum pariatur esse nulla Lorem nostrud. Ea elit consectetur id duis quis. Fugiat excepteur amet officia elit laborum velit sit. Officia laboris sit qui laboris eu eiusmod adipisicing do minim ea labore.\n\nTempor aliqua consequat ullamco magna sit fugiat fugiat excepteur dolore labore. Do pariatur velit officia ea. Elit commodo qui voluptate minim sunt sint ex quis est enim proident et aute cupidatat.\n\nIn adipisicing anim id fugiat tempor do cupidatat proident dolor amet ad officia in nostrud. Ea duis do enim nisi ea qui. Voluptate non qui sunt commodo ea anim incididunt commodo deserunt adipisicing labore. Aliquip tempor amet magna sint consequat qui irure magna mollit elit aute. Fugiat non ipsum enim ex ex do. Ullamco voluptate officia ad in ipsum cillum ad cupidatat irure in culpa officia elit esse.",
    "isFavourite": true,
    "rating": 5,
    "price": "$354.73",
    "oldPrice": "$546.33",
    "savings": "$80.19",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "s"
  },
  {
    "_id": "5af6ac50a221a8dce712b7e9",
    "index": 37,
    "guid": "cc439630-6e47-4982-99a7-7d17933cf4e3",
    "name": "cupidatat esse consequat",
    "brand": "GEEKUS",
    "descShort": "Nulla est duis ullamco excepteur anim amet enim.",
    "descFull":
      "Ullamco ea magna laborum eu occaecat est reprehenderit irure eiusmod Lorem dolor. Laboris nulla pariatur enim laboris excepteur ut quis aliquip tempor occaecat consequat. Officia culpa cillum ipsum id laboris duis veniam voluptate minim. In esse aute sint quis aute aliquip nulla voluptate ipsum laboris ullamco. Laborum sint amet ad occaecat sunt et aliqua ullamco ea.\n\nMollit do fugiat ipsum commodo dolor occaecat officia occaecat deserunt cillum fugiat adipisicing. Ea nulla voluptate nostrud nostrud dolore consectetur fugiat nostrud et nulla eu eiusmod. Incididunt elit veniam exercitation elit cillum consequat ea et aliqua magna pariatur cupidatat. Anim commodo id incididunt sunt. Eu ipsum aliquip do non ut ullamco ad mollit quis sit duis labore. Eu qui adipisicing nisi velit pariatur Lorem.\n\nIn ipsum cupidatat duis officia id id irure nulla. Duis aliquip Lorem labore ex eu proident ullamco. Reprehenderit Lorem laboris deserunt consequat eiusmod minim est incididunt mollit.",
    "isFavourite": true,
    "rating": 3,
    "price": "$250.50",
    "oldPrice": "$848.03",
    "savings": "$88.59",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "xl"
  },
  {
    "_id": "5af6ac506f01ce286bb426a5",
    "index": 38,
    "guid": "d185c63d-4847-42b5-be00-1a3bfdeb2d4e",
    "name": "consectetur esse eu",
    "brand": "XYMONK",
    "descShort": "Mollit elit id sint laboris.",
    "descFull": "Officia minim dolor adipisicing fugiat. Adipisicing ipsum velit laborum nisi officia et. Cillum ea laborum dolore irure est enim.\n\nId sit ullamco eiusmod Lorem voluptate eiusmod eu eiusmod ut. Et do enim nisi magna laborum ad duis est occaecat veniam commodo officia magna enim. Qui ex culpa ex sunt ea laboris id proident aliquip. Laboris adipisicing ut aute do aliqua aute deserunt. Eu aliquip occaecat nisi quis. Voluptate excepteur non duis nisi exercitation sit laborum et do officia commodo.\n\nEx irure incididunt voluptate id nostrud nostrud et. Aliqua dolore anim voluptate commodo sint officia. Labore do deserunt consectetur elit reprehenderit ex occaecat ex amet. Laborum ad in dolor dolore in.",
    "isFavourite": true,
    "rating": 4,
    "price": "$235.25",
    "oldPrice": "$453.31",
    "savings": "$59.16",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "l"
  },
  {
    "_id": "5af6ac5033d4c957267bcc83",
    "index": 39,
    "guid": "aacdcd58-27ee-4ed7-8679-f44e8910caab",
    "name": "eiusmod quis ullamco",
    "brand": "INSURESYS",
    "descShort": "Aliquip sunt fugiat amet elit et aute.",
    "descFull":
      "Id occaecat deserunt sint irure eu dolor quis ipsum eu. Consequat sit reprehenderit laborum nisi laborum consequat exercitation irure eiusmod quis cupidatat aute mollit. Ut dolor tempor ipsum labore do commodo mollit consequat eiusmod. Quis adipisicing mollit dolor est irure voluptate tempor eiusmod excepteur ullamco. Minim nisi quis velit consequat amet non enim ullamco. Pariatur incididunt labore Lorem id ad exercitation in quis magna anim consequat. Velit dolor officia mollit officia ex ad aliquip sit veniam tempor elit.\n\nAd magna occaecat amet qui minim consectetur dolore. In do velit incididunt dolor aliqua laborum amet voluptate in fugiat mollit laborum aliqua. Laboris elit minim minim nulla amet culpa exercitation elit adipisicing dolor id magna anim id. Duis excepteur consectetur id ullamco laborum ut labore nulla proident pariatur cupidatat do magna ullamco. Occaecat enim sunt ut nulla aliqua culpa in quis. Enim aliqua consectetur consectetur eu dolore quis labore magna dolor ea nostrud non est.\n\nTempor nostrud labore duis nisi occaecat cillum excepteur pariatur reprehenderit non nulla adipisicing. Cupidatat id sint ut labore excepteur cillum consectetur deserunt consectetur eiusmod quis sit esse Lorem. Veniam tempor incididunt minim officia ad commodo nulla quis exercitation esse veniam ex qui quis. Amet dolore enim qui velit nulla ad amet officia ipsum Lorem reprehenderit id quis aute.",
    "isFavourite": false,
    "rating": 2,
    "price": "$222.27",
    "oldPrice": "$858.51",
    "savings": "$60.41",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "xl"
  },
  {
    "_id": "5af6ac50723f63127a599588",
    "index": 40,
    "guid": "80a1aa87-5e7d-44b4-b20d-72c0dc2e3bf0",
    "name": "eu ipsum adipisicing",
    "brand": "ZENOLUX",
    "descShort": "Officia fugiat labore aliquip ea eu consectetur excepteur fugiat.",
    "descFull": "Anim mollit irure cupidatat ea cupidatat proident laboris ad deserunt consectetur ad aute minim commodo. Velit excepteur ad ea nisi consequat consequat veniam. Ea elit qui Lorem eiusmod ipsum duis consectetur qui consectetur in eu nisi. Sunt aute incididunt quis laboris incididunt id nostrud. Tempor sunt ex velit duis eiusmod Lorem Lorem.\n\nOfficia aliquip aute aliquip sit. Excepteur aliquip consectetur ipsum tempor enim ipsum quis cillum est laborum irure. In magna duis nostrud irure exercitation aute.\n\nAliqua mollit deserunt veniam aute anim duis elit sit incididunt non adipisicing cillum. Sit ex velit sit non aliquip amet. Enim culpa mollit incididunt quis voluptate ipsum reprehenderit ex incididunt ad veniam aliquip.",
    "isFavourite": true,
    "rating": 3,
    "price": "$157.39",
    "oldPrice": "$771.52",
    "savings": "$65.43",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "m"
  },
  {
    "_id": "5af6ac5034c5dd6b7f8864a6",
    "index": 41,
    "guid": "0a7b6c64-02c3-4f0a-92bb-4ce3855f35d5",
    "name": "proident reprehenderit voluptate",
    "brand": "BIOLIVE",
    "descShort": "Velit esse aliqua non aliqua veniam.",
    "descFull":
      "Cupidatat ea nulla labore in nisi proident fugiat irure do voluptate. Proident excepteur in aute mollit id. Et proident Lorem anim dolor reprehenderit aliqua duis consequat reprehenderit eu incididunt voluptate dolore ullamco. Duis ipsum ipsum ad duis nostrud tempor et voluptate sit pariatur sunt mollit duis. Et eiusmod duis irure excepteur. Dolor labore irure eu laboris velit. Aliqua et dolore proident velit irure quis consequat sit laboris aliqua.\n\nSint qui ex occaecat qui pariatur reprehenderit occaecat tempor ea voluptate ad eiusmod minim. Ad non incididunt laborum nisi veniam tempor enim qui. Exercitation nostrud sint exercitation et in irure anim mollit enim et duis officia ut dolor. Consequat in veniam do minim labore dolore cupidatat anim cupidatat. Elit pariatur fugiat nostrud pariatur cupidatat occaecat velit elit qui ullamco elit tempor. In ut est culpa occaecat exercitation adipisicing nisi. Laborum irure aliqua irure laborum in et ullamco eu.\n\nVelit est do aute nulla esse labore reprehenderit eiusmod veniam anim. Ut amet elit magna sunt commodo. Anim Lorem aliquip cupidatat velit fugiat est pariatur aliqua cillum est anim.",
    "isFavourite": true,
    "rating": 1,
    "price": "$132.97",
    "oldPrice": "$416.68",
    "savings": "$89.29",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "l"
  },
  {
    "_id": "5af6ac50368057d8195dc917",
    "index": 42,
    "guid": "fe4dc2e3-feb7-40a5-8eff-3ff975bf723f",
    "name": "ipsum dolor laborum",
    "brand": "QIMONK",
    "descShort": "Commodo ipsum quis voluptate ex.",
    "descFull":
      "In amet aliqua irure et mollit Lorem nulla esse dolore anim ex commodo. Ut qui labore id dolore reprehenderit sint. Voluptate ipsum labore irure exercitation non ullamco proident qui non excepteur eu culpa. Dolor culpa nulla mollit aliquip dolore tempor qui voluptate ullamco mollit sit consequat. Nulla aliquip ex fugiat adipisicing velit. Velit quis sint aliquip pariatur Lorem exercitation Lorem velit. Nisi incididunt ut tempor aliquip officia incididunt.\n\nUllamco voluptate laboris enim consectetur amet amet dolor. Commodo sit adipisicing nisi Lorem. Aliqua officia minim consectetur incididunt et voluptate Lorem commodo. Ex et pariatur culpa dolore Lorem. Excepteur laborum veniam enim reprehenderit aliqua. Excepteur nostrud id et nisi ullamco commodo est deserunt duis.\n\nAdipisicing magna ea amet cupidatat sint aliqua quis Lorem. Dolore velit magna aliqua excepteur excepteur eiusmod exercitation mollit. Consequat reprehenderit sint consectetur est ut. Anim enim ea labore irure sit voluptate nostrud aliqua minim veniam ipsum pariatur. Est tempor magna incididunt minim id qui id eu mollit quis. In dolor ullamco laboris dolor aute id sunt qui et laborum.",
    "isFavourite": true,
    "rating": 4,
    "price": "$212.60",
    "oldPrice": "$605.90",
    "savings": "$93.76",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "l"
  },
  {
    "_id": "5af6ac508f3e5792f84385aa",
    "index": 43,
    "guid": "69876c74-4d4f-402f-8867-8fa78896dbdf",
    "name": "mollit duis qui",
    "brand": "CONFRENZY",
    "descShort": "Anim deserunt et pariatur id elit.",
    "descFull":
      "Proident in esse non cupidatat ut fugiat aliqua deserunt dolore occaecat ullamco Lorem. Sunt Lorem labore deserunt Lorem irure labore consectetur. Proident deserunt esse occaecat sunt tempor reprehenderit eiusmod sint cupidatat incididunt. Enim consequat fugiat dolore ullamco laboris culpa cillum incididunt aliqua. Sint esse voluptate duis nisi elit nulla quis culpa nisi reprehenderit reprehenderit irure ex. Id dolor adipisicing enim anim irure et non. Est sunt dolor Lorem et ad in anim consectetur magna eu.\n\nNostrud laborum sunt reprehenderit velit tempor nulla ea ad non veniam eiusmod. Non ad minim ad dolore pariatur reprehenderit occaecat velit nulla nisi aute minim. Labore ad Lorem tempor sit consequat occaecat enim ea ipsum ex excepteur consectetur et. Occaecat culpa commodo ex irure irure ex ad anim et ea fugiat nulla.\n\nOfficia deserunt adipisicing pariatur consequat fugiat eiusmod consectetur aliquip commodo. Eiusmod aliquip adipisicing adipisicing labore nisi. Sit amet dolore sint aute dolore consequat non et ad qui.",
    "isFavourite": true,
    "rating": 5,
    "price": "$129.83",
    "oldPrice": "$958.37",
    "savings": "$37.55",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "xl"
  },
  {
    "_id": "5af6ac508b8c2dee54031d72",
    "index": 44,
    "guid": "2a6ce14c-af9a-4072-8e4b-4b24d17e7a9e",
    "name": "sunt laboris ullamco",
    "brand": "GONKLE",
    "descShort": "Adipisicing voluptate tempor duis pariatur.",
    "descFull":
      "Ex adipisicing ut ex consequat dolor fugiat. Minim commodo amet consequat fugiat irure cupidatat irure occaecat exercitation nisi incididunt in ipsum. Qui labore mollit incididunt consectetur ullamco nulla culpa veniam occaecat consectetur. Officia id sunt et consequat non laborum nulla. Nostrud velit dolore ea irure enim enim. Ullamco id ex laborum consectetur pariatur reprehenderit in pariatur exercitation veniam. Consectetur consequat ut pariatur adipisicing duis mollit exercitation cupidatat non nisi ut ex duis aliqua.\n\nIpsum pariatur ipsum ad excepteur ut nulla duis. Ex nisi et veniam laboris sint qui fugiat culpa nostrud anim. Voluptate reprehenderit minim ad dolor excepteur mollit occaecat nulla mollit nisi officia est. Commodo tempor dolor nisi ullamco ad aute Lorem.\n\nDuis deserunt commodo enim non exercitation esse cupidatat occaecat magna eu aliquip dolor. Dolor eu sit est tempor reprehenderit nostrud. Adipisicing sit ea ad exercitation officia est occaecat consectetur exercitation Lorem exercitation amet elit officia.",
    "isFavourite": true,
    "rating": 1,
    "price": "$224.15",
    "oldPrice": "$665.56",
    "savings": "$40.08",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "m"
  },
  {
    "_id": "5af6ac50a168749f7110d16c",
    "index": 45,
    "guid": "cabc5add-66ae-4951-9806-0e89fc14ed8f",
    "name": "fugiat cillum veniam",
    "brand": "SATIANCE",
    "descShort": "Culpa excepteur magna eiusmod duis sunt non adipisicing.",
    "descFull":
      "Aute irure excepteur consectetur et commodo. Consectetur nulla do aute enim consequat excepteur sunt magna amet in ex fugiat labore laborum. Reprehenderit eu elit pariatur velit ut. Non pariatur proident anim magna. Esse laborum incididunt commodo ut incididunt magna.\n\nCupidatat ad aliquip nostrud ut minim tempor incididunt nisi et elit officia cupidatat. Sint officia laboris magna ex pariatur. Commodo aute irure nulla fugiat ea consectetur labore esse laborum incididunt.\n\nConsectetur esse minim commodo enim sint voluptate duis proident magna culpa. Qui amet do magna irure officia id cupidatat. Dolore duis nisi est do Lorem laborum ipsum. Adipisicing id amet consectetur nisi eiusmod id magna elit dolor nisi eu sint quis. Excepteur reprehenderit elit officia excepteur sit officia ipsum aute. Non proident est non minim cillum. Laborum duis enim deserunt deserunt quis qui pariatur pariatur excepteur nulla dolore.",
    "isFavourite": true,
    "rating": 1,
    "price": "$303.89",
    "oldPrice": "$585.88",
    "savings": "$75.43",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "xl"
  },
  {
    "_id": "5af6ac504abf6402ef465d87",
    "index": 46,
    "guid": "3a849b57-77a1-4737-934c-9b2526d51a09",
    "name": "adipisicing quis officia",
    "brand": "SNACKTION",
    "descShort": "Labore occaecat eiusmod cillum elit duis exercitation enim.",
    "descFull": "Nulla est sint laborum nisi enim eu mollit sunt. Fugiat Lorem sint esse est ipsum. Sint commodo et quis officia ex aliqua exercitation.\n\nMinim do nostrud nisi laboris eiusmod veniam laboris ullamco et. Laboris proident officia fugiat velit mollit officia fugiat nisi. Nisi cillum id reprehenderit aute ullamco quis labore do cupidatat incididunt voluptate do.\n\nEiusmod labore est ad cillum dolore minim exercitation eu voluptate culpa. Enim consectetur veniam officia sint id amet ullamco eiusmod aute nulla incididunt. Magna id amet duis culpa minim nostrud consequat esse non eiusmod mollit. Esse in sit labore ut. Ea ea eu consequat et sunt fugiat magna est in.",
    "isFavourite": false,
    "rating": 2,
    "price": "$159.16",
    "oldPrice": "$787.43",
    "savings": "$67.40",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "xl"
  },
  {
    "_id": "5af6ac50f9e934813c4d00d9",
    "index": 47,
    "guid": "80d51420-345e-417f-bf96-0ba794d8eda2",
    "name": "in magna laborum",
    "brand": "STUCCO",
    "descShort": "Ad qui magna voluptate nostrud.",
    "descFull":
      "Sint duis do mollit adipisicing irure. Cupidatat ut ullamco anim sunt eiusmod nulla proident adipisicing eu elit aliqua adipisicing anim. Cupidatat elit enim cillum duis cupidatat in. Excepteur laboris mollit est ut exercitation commodo ea excepteur occaecat laborum.\n\nEx nostrud reprehenderit cillum eiusmod irure. Aute magna qui ipsum consequat enim cillum sint reprehenderit pariatur amet voluptate quis exercitation. Sint tempor culpa Lorem labore est id. Occaecat anim sunt proident Lorem qui id adipisicing nisi ullamco est. Veniam ut cillum in sint incididunt.\n\nAdipisicing exercitation do in sit incididunt velit Lorem consequat cupidatat velit deserunt mollit ea voluptate. Non adipisicing laboris sint aliquip pariatur est reprehenderit dolore do. Quis officia eu dolor voluptate do deserunt enim do et officia in in.",
    "isFavourite": true,
    "rating": 2,
    "price": "$379.78",
    "oldPrice": "$701.35",
    "savings": "$18.28",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "l"
  },
  {
    "_id": "5af6ac5013829c97bc99ab69",
    "index": 48,
    "guid": "00c8f085-4622-4da7-bc47-842feee88abc",
    "name": "nisi qui minim",
    "brand": "XEREX",
    "descShort": "Irure veniam dolore esse non proident fugiat consequat incididunt pariatur mollit nulla ullamco enim.",
    "descFull":
      "Eu amet non laborum nisi esse sint anim occaecat adipisicing ad quis sunt. Duis cillum cillum cupidatat et sint velit ipsum aliqua aute. Ullamco duis amet et consectetur sit eiusmod ullamco adipisicing minim eiusmod pariatur ad. Id consequat Lorem non cupidatat adipisicing sint sit fugiat deserunt sint incididunt incididunt ex.\n\nMollit duis dolor sint irure magna ullamco cupidatat. Aliquip do cillum culpa proident minim do dolore dolore tempor dolore pariatur veniam occaecat aliquip. Do commodo ex consequat consequat quis nostrud voluptate laboris occaecat.\n\nOccaecat ut sunt tempor do sint aliquip reprehenderit amet deserunt deserunt consectetur id elit. Amet aliquip enim amet sint nisi exercitation ipsum et sunt commodo tempor. Id culpa exercitation nisi labore tempor adipisicing ea minim tempor nulla eu adipisicing enim.",
    "isFavourite": false,
    "rating": 1,
    "price": "$255.87",
    "oldPrice": "$457.35",
    "savings": "$20.06",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "m"
  },
  {
    "_id": "5af6ac5088e601f14ad9c751",
    "index": 49,
    "guid": "fec61838-c513-4014-b30a-144702613bb1",
    "name": "deserunt mollit magna",
    "brand": "DATAGENE",
    "descShort": "Dolore nostrud proident adipisicing eu cupidatat pariatur laborum non sunt dolor laborum exercitation pariatur velit.",
    "descFull":
      "Do amet veniam esse aliqua velit. Sit ex duis Lorem adipisicing aliqua fugiat aliquip amet enim. Tempor ea cillum incididunt ad fugiat mollit. Officia dolore veniam nisi sunt nostrud elit laborum eu. Ad laborum nostrud ad velit reprehenderit sunt ex.\n\nMinim commodo consectetur adipisicing adipisicing cillum do. Voluptate cupidatat in proident ex nulla velit est deserunt qui sint anim elit occaecat occaecat. Cillum minim qui excepteur exercitation eu minim amet. Esse elit veniam consequat Lorem mollit ut eiusmod aliqua enim excepteur ipsum nisi magna. Adipisicing tempor ullamco qui ad et aute sunt ullamco.\n\nUt reprehenderit commodo mollit qui aliquip commodo excepteur. Occaecat id incididunt adipisicing incididunt amet aliqua. Excepteur quis nulla commodo officia Lorem dolore nostrud commodo enim officia tempor tempor. Duis incididunt consequat sit ea pariatur nisi quis labore ad labore ipsum. In consectetur officia id et proident. Do veniam adipisicing amet ut.",
    "isFavourite": false,
    "rating": 2,
    "price": "$360.37",
    "oldPrice": "$735.46",
    "savings": "$24.81",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "xl"
  },
  {
    "_id": "5af6ac509a7fee2d2fbfc495",
    "index": 50,
    "guid": "7ca50249-34d7-43a2-9a03-b7333a0a330d",
    "name": "dolor mollit exercitation",
    "brand": "RODEOMAD",
    "descShort": "Id duis do aute officia enim consectetur nulla exercitation anim ea cillum commodo ex.",
    "descFull":
      "In ad pariatur enim sint deserunt excepteur mollit tempor sint. Fugiat adipisicing pariatur incididunt mollit. Irure ea ut nulla mollit consequat deserunt nulla esse enim commodo minim et. Exercitation id quis veniam proident aliquip sunt quis exercitation consequat minim. Proident elit esse id esse et non consectetur nisi ullamco proident et consequat. Excepteur in ex ipsum nulla enim ipsum nisi proident consequat velit excepteur duis non. Laborum in excepteur aute minim pariatur aliqua.\n\nLaborum laboris sunt non irure nulla. Cillum consectetur occaecat velit ullamco consequat. Incididunt et elit culpa mollit ea veniam sunt sit incididunt aute ex. Mollit et nostrud Lorem exercitation proident ipsum non commodo culpa tempor esse commodo. Irure ex cupidatat elit aliquip nostrud cupidatat ut laborum labore officia. Do ad Lorem deserunt consectetur labore.\n\nSunt adipisicing et nulla ex consequat mollit nisi dolore voluptate cillum esse. Lorem ea magna elit elit ut. Aliquip excepteur do esse proident ad officia consequat mollit Lorem culpa eu qui elit ad. Proident fugiat excepteur non ad aliquip. Minim enim aliqua nisi ut tempor adipisicing culpa elit elit commodo pariatur. Ipsum ut mollit anim cillum occaecat commodo officia id dolor in deserunt sunt. Consectetur adipisicing fugiat duis tempor excepteur adipisicing ad ex ut laborum cupidatat voluptate consequat.",
    "isFavourite": false,
    "rating": 2,
    "price": "$306.65",
    "oldPrice": "$595.29",
    "savings": "$51.34",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "s"
  },
  {
    "_id": "5af6ac50e1e40da65f73abf6",
    "index": 51,
    "guid": "c9f9bd94-0fad-4603-a542-6100d968c603",
    "name": "dolore duis aute",
    "brand": "VOLAX",
    "descShort": "Laboris commodo minim aute elit non cupidatat dolor anim.",
    "descFull":
      "Commodo consequat mollit enim laboris aliquip veniam ex exercitation. Cillum eu tempor adipisicing voluptate ut dolore mollit dolore et ex do. Pariatur sunt anim esse ad reprehenderit nostrud amet. Laboris ullamco occaecat enim mollit id minim consequat. Velit exercitation nisi ad duis pariatur laboris laborum adipisicing nostrud mollit adipisicing minim esse. Esse tempor esse reprehenderit amet ea ullamco enim labore non dolore ea duis. Anim commodo fugiat enim reprehenderit fugiat nisi occaecat ex reprehenderit et fugiat consectetur et cupidatat.\n\nLorem commodo labore ex ipsum adipisicing ea in Lorem commodo et qui nostrud amet. Labore exercitation ut consequat eu adipisicing commodo et irure esse voluptate. Aute est ad ut magna quis ipsum quis est nulla nulla anim. Nisi deserunt laboris do dolor tempor. Anim nulla dolore deserunt proident eiusmod ut dolore aute sint ea aliqua incididunt est.\n\nLorem irure qui mollit eu laboris. Enim ex duis pariatur minim commodo aute. Nisi dolore sint do sit labore incididunt.",
    "isFavourite": false,
    "rating": 3,
    "price": "$185.38",
    "oldPrice": "$962.71",
    "savings": "$48.34",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "s"
  },
  {
    "_id": "5af6ac50f886b0f8a4a7c066",
    "index": 52,
    "guid": "ce11d23c-b5b1-4afb-a224-fd8d27b39fe6",
    "name": "officia in dolor",
    "brand": "MUSAPHICS",
    "descShort": "Et excepteur incididunt consequat est aute in ad.",
    "descFull": "Commodo duis incididunt nisi aliquip quis aute reprehenderit aliqua tempor. Nostrud excepteur non aliqua sint veniam quis incididunt nostrud. Sint est eiusmod irure anim tempor mollit mollit duis proident consequat minim exercitation. Est excepteur incididunt dolor ea amet duis velit culpa incididunt.\n\nEnim occaecat ex amet cupidatat eiusmod sit veniam ex ad velit Lorem. Tempor eiusmod eiusmod in quis nulla aliquip commodo aliqua est aute. Ex magna esse incididunt qui consectetur incididunt.\n\nCulpa ea tempor ut voluptate eu reprehenderit enim laborum officia minim amet reprehenderit. Nostrud nostrud ullamco non consectetur pariatur est excepteur sit adipisicing in culpa. Laborum est id commodo deserunt incididunt ex laborum excepteur ad amet consequat.",
    "isFavourite": false,
    "rating": 3,
    "price": "$151.98",
    "oldPrice": "$625.28",
    "savings": "$4.78",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "m"
  },
  {
    "_id": "5af6ac505f0172d515b7e57c",
    "index": 53,
    "guid": "02ca0f18-b4f5-4937-b1a6-5a6dc3025984",
    "name": "duis aliqua culpa",
    "brand": "IDETICA",
    "descShort": "Incididunt culpa magna nostrud elit.",
    "descFull":
      "Do consequat ea incididunt culpa exercitation veniam. Velit officia duis incididunt voluptate non ad et est. Reprehenderit enim aliquip deserunt magna voluptate laboris ea in deserunt adipisicing eiusmod do ipsum sit. Nisi minim et proident ipsum consectetur do cillum. Quis eiusmod est voluptate ea excepteur consequat ullamco eu adipisicing fugiat dolor. Officia enim elit eiusmod labore velit magna sit eu ullamco do duis. Ullamco esse esse enim culpa esse qui incididunt mollit sunt quis tempor duis ea pariatur.\n\nProident aliqua consectetur ipsum irure esse anim culpa non qui sint sit laborum consectetur. Aute id cillum Lorem magna laboris voluptate ad nulla reprehenderit quis esse sunt qui. Ad occaecat Lorem fugiat id est laboris adipisicing cillum deserunt. In Lorem proident anim consequat. Lorem adipisicing quis exercitation duis officia anim irure deserunt ea nisi.\n\nQuis tempor eiusmod anim velit sunt Lorem enim ut elit aliquip veniam nisi culpa et. Qui minim voluptate excepteur laborum deserunt laboris consequat ullamco eiusmod velit in consectetur. Pariatur eiusmod commodo exercitation proident excepteur aute laborum minim ullamco proident proident dolor.",
    "isFavourite": false,
    "rating": 4,
    "price": "$106.73",
    "oldPrice": "$787.77",
    "savings": "$25.47",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "m"
  },
  {
    "_id": "5af6ac500ad79e7d5ec4216d",
    "index": 54,
    "guid": "7231a4d5-f4bb-4945-bb1c-90f6b42b5e2f",
    "name": "tempor dolore fugiat",
    "brand": "DIGIFAD",
    "descShort": "Excepteur quis velit ex in aute.",
    "descFull":
      "Aliqua officia Lorem est culpa mollit eiusmod proident aliquip magna deserunt sit sunt ad consectetur. Officia laborum pariatur minim sint excepteur ullamco velit adipisicing amet ut sit magna. Id ipsum minim mollit sint.\n\nFugiat labore laborum commodo ad aute aute incididunt magna eiusmod sint aliquip mollit nisi. Eu anim labore esse sit do nulla aute veniam officia. Nulla dolor id aute proident. Reprehenderit cillum ad nulla aute Lorem proident adipisicing sint cillum sint do do irure.\n\nCommodo et exercitation dolore quis elit occaecat sunt nisi. Aliquip sunt consectetur cillum mollit aute culpa reprehenderit proident consectetur ut ad dolore. Sunt consequat irure est amet. Enim ea do mollit exercitation exercitation sunt velit anim et aliqua excepteur dolore. Non in cillum qui ullamco ea culpa ad id eu quis. Reprehenderit veniam velit deserunt nostrud sit proident id cupidatat deserunt mollit.",
    "isFavourite": true,
    "rating": 5,
    "price": "$290.83",
    "oldPrice": "$812.00",
    "savings": "$25.17",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "s"
  },
  {
    "_id": "5af6ac50c889449cfc3dfc75",
    "index": 55,
    "guid": "1e99b33e-b6f0-4a08-a381-2843303169fe",
    "name": "anim pariatur consequat",
    "brand": "YOGASM",
    "descShort": "Deserunt fugiat enim exercitation consectetur velit laboris elit in aute voluptate magna veniam nisi excepteur.",
    "descFull":
      "Reprehenderit tempor incididunt sint cillum dolor incididunt consequat. Consectetur officia nostrud proident nulla nulla Lorem sunt sunt aliquip ipsum. Aliquip dolor culpa id eu exercitation sint sunt ullamco. Nulla incididunt qui consequat cupidatat irure minim. Pariatur qui ipsum voluptate tempor id in est enim commodo cillum mollit consectetur.\n\nUllamco magna et qui velit eiusmod et. Dolore do labore dolore tempor minim Lorem velit minim est enim. Nisi minim ex amet esse exercitation eiusmod.\n\nElit fugiat nostrud reprehenderit dolor qui. Minim ex nostrud sint laboris est consectetur. Pariatur cillum aute eiusmod adipisicing. Do id ipsum nisi consectetur reprehenderit. Nulla aliqua veniam labore ullamco nulla laboris ad. Laboris culpa minim aute veniam sit et ullamco velit excepteur veniam veniam commodo ea do.",
    "isFavourite": true,
    "rating": 4,
    "price": "$146.26",
    "oldPrice": "$669.33",
    "savings": "$68.63",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "m"
  },
  {
    "_id": "5af6ac5033fecbac15332d3a",
    "index": 56,
    "guid": "cf64ec4a-fc72-4381-8181-ebe2c4dbf8e8",
    "name": "ad aute ad",
    "brand": "STRALOY",
    "descShort": "Nisi deserunt aliquip mollit esse ex exercitation adipisicing ex eu nisi.",
    "descFull":
      "Reprehenderit non mollit laboris id dolor non incididunt id eu quis dolore duis. Adipisicing velit mollit nulla fugiat amet. Qui id ea sit eiusmod. Voluptate duis deserunt et aute.\n\nReprehenderit voluptate magna veniam magna duis ea sint sit ad incididunt elit ipsum sit proident. Proident occaecat eiusmod Lorem laboris. Cillum qui fugiat excepteur et reprehenderit et sunt dolor. Est in officia occaecat esse dolore.\n\nEx sit proident Lorem veniam. Voluptate nostrud amet irure ipsum id irure adipisicing amet nisi est. Incididunt consequat ipsum labore sit dolor esse sit anim. Incididunt incididunt fugiat ipsum consequat cillum. Reprehenderit aute ullamco cupidatat nulla amet. Nulla laboris incididunt ipsum ea anim pariatur nostrud nisi cillum excepteur nulla. Dolor cillum consequat non velit et enim in ipsum exercitation.",
    "isFavourite": true,
    "rating": 2,
    "price": "$136.90",
    "oldPrice": "$421.06",
    "savings": "$61.52",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "m"
  },
  {
    "_id": "5af6ac50988b7f3f2bbab324",
    "index": 57,
    "guid": "1aaac61b-ff2f-494e-817c-235566af3413",
    "name": "adipisicing tempor tempor",
    "brand": "ACIUM",
    "descShort": "Amet occaecat anim deserunt aute mollit.",
    "descFull":
      "Ex commodo proident dolore quis aute. Occaecat nostrud ea nulla est labore mollit voluptate consequat minim. Anim officia ad proident pariatur ad minim. Do eu ipsum minim voluptate et sint ullamco amet tempor duis veniam. Nostrud nostrud aute ex et proident commodo.\n\nIn quis quis nisi nulla ipsum laborum Lorem laboris exercitation. Dolor nulla ex enim velit consequat anim ut cillum in dolore proident. Anim deserunt sit do cillum commodo. Dolore mollit laboris non magna reprehenderit sit laboris est quis cillum. Anim ullamco laborum in non ipsum adipisicing aute sint esse. Cupidatat esse Lorem cupidatat deserunt voluptate laboris non tempor quis qui esse labore.\n\nConsequat minim cillum ea commodo ut sit ex ex officia excepteur do in aliquip. Voluptate qui anim deserunt Lorem nulla adipisicing ad. Eu proident cupidatat duis magna tempor ipsum sint. Sint do adipisicing ipsum id non in incididunt laborum do incididunt veniam mollit. Cupidatat mollit culpa ex eu qui officia aute consectetur excepteur pariatur sit.",
    "isFavourite": false,
    "rating": 4,
    "price": "$191.56",
    "oldPrice": "$608.54",
    "savings": "$33.55",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "m"
  },
  {
    "_id": "5af6ac50fbb3366be53fe4ee",
    "index": 58,
    "guid": "474af116-7926-40e8-afb7-8e40b2fab11e",
    "name": "in veniam aliquip",
    "brand": "EXTREMO",
    "descShort": "Incididunt fugiat cillum cupidatat tempor ea do do do ex nisi cillum non.",
    "descFull":
      "Proident dolore ipsum magna do aliqua nulla deserunt officia magna do veniam. Consequat veniam excepteur et irure tempor. Adipisicing tempor dolore et irure aute quis minim magna.\n\nAute fugiat officia irure cillum et non duis aliquip exercitation est nostrud. Excepteur id proident sit adipisicing nisi ut aliquip eiusmod ea culpa commodo. In tempor dolor labore deserunt sunt ex eu irure elit ex. Pariatur sit deserunt labore non officia quis deserunt aute excepteur laboris. Laboris cillum consequat tempor magna tempor commodo cillum consectetur elit pariatur veniam tempor. Velit tempor commodo nisi do aute est proident velit sunt exercitation consectetur. Sint dolor consectetur non id dolor commodo exercitation laborum non.\n\nLaborum non laboris cillum in qui aute. Commodo ea voluptate elit id duis sit tempor in sunt do id. Cillum proident dolor irure exercitation aliquip elit fugiat magna aute anim. Amet ut enim laborum reprehenderit fugiat cupidatat qui ipsum sint pariatur.",
    "isFavourite": false,
    "rating": 4,
    "price": "$284.84",
    "oldPrice": "$850.88",
    "savings": "$78.38",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "s"
  },
  {
    "_id": "5af6ac500091b1f5988ddd9e",
    "index": 59,
    "guid": "5764dab2-e30c-4888-a1db-cfaee605daa3",
    "name": "esse pariatur deserunt",
    "brand": "COASH",
    "descShort": "Est amet aute velit pariatur laboris officia adipisicing ullamco laborum labore.",
    "descFull":
      "Ut incididunt laborum pariatur irure quis culpa et eu velit ullamco irure ex minim. Ipsum amet laborum in elit laboris cupidatat ipsum excepteur eiusmod excepteur qui voluptate deserunt sint. Adipisicing anim qui veniam minim do eu eu nulla enim minim labore. Lorem nostrud aliqua occaecat culpa non mollit.\n\nDolore et do est fugiat fugiat aliquip ad sint. Sunt occaecat magna officia amet labore minim Lorem sunt quis mollit et tempor in do. Reprehenderit consequat velit nostrud consequat do laboris magna amet. Id eiusmod quis magna eu qui laborum veniam. Lorem do ad cupidatat velit duis veniam id officia adipisicing ipsum sint incididunt. Laboris eu ipsum nostrud deserunt eu labore. Labore enim incididunt duis consequat anim aliqua.\n\nAnim ea dolore ullamco ipsum pariatur excepteur. Excepteur est cupidatat pariatur velit. Veniam do ipsum in ex cillum deserunt quis ad cillum pariatur laboris consectetur et.",
    "isFavourite": true,
    "rating": 2,
    "price": "$394.08",
    "oldPrice": "$850.00",
    "savings": "$73.07",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "s"
  },
  {
    "_id": "5af6ac50b306d7fd33b98b25",
    "index": 60,
    "guid": "9e7090ab-818d-4392-b4b5-099be624b9ba",
    "name": "exercitation irure elit",
    "brand": "CENTREXIN",
    "descShort": "Ut ad cillum aliquip laborum adipisicing pariatur culpa tempor anim aliquip.",
    "descFull":
      "Amet aute sint tempor occaecat proident et tempor id cupidatat laboris irure commodo pariatur consequat. Voluptate culpa proident excepteur adipisicing consequat ut pariatur in aliquip amet. Mollit esse dolore laborum exercitation aliquip sunt. Voluptate minim aute consectetur occaecat. Anim culpa velit exercitation do ullamco irure tempor. Labore irure minim tempor magna aliqua labore sunt esse laboris nisi nulla.\n\nCommodo et amet non nisi. Excepteur tempor cupidatat anim esse minim aliqua. Ut aute veniam dolor reprehenderit irure amet. Aute incididunt pariatur adipisicing ea adipisicing sit cillum culpa. Occaecat do id consequat irure laborum ipsum magna nisi aliqua ex ex nisi cupidatat amet. Sint aliqua ipsum ea labore. In exercitation aute tempor consectetur aliquip quis occaecat.\n\nOfficia incididunt duis fugiat consequat proident ullamco ad qui do commodo velit in reprehenderit. Aliqua nulla amet tempor amet aute et tempor voluptate id consectetur veniam ea. Ut veniam id et amet exercitation adipisicing tempor anim amet ad amet cillum pariatur. Eiusmod sit elit proident ullamco deserunt duis. Nulla excepteur dolore cillum proident. Nisi do ut proident ipsum labore ut deserunt duis amet eu aliquip magna cupidatat Lorem.",
    "isFavourite": false,
    "rating": 5,
    "price": "$120.97",
    "oldPrice": "$595.17",
    "savings": "$31.06",
    "thumb": "http://placehold.it/200x200",
    "images": ["http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600", "http://placehold.it/800x600"],
    "size": "s"
  }
]
